function markDay(cell,cYear,cMonth,cDate) {  // 本日、祝日のhintを追加
        let hnm = noteDay(new Date(cYear,cMonth-1,cDate));
        // If the cell is the current date or holiday, highlight it
        if (hnm!="") {
            cell.classList.add((hnm=='本日'? "today":"holiday"));
            cell.setAttribute("title", hnm);
        }
	return cDate; 
}
function noteDay(Target) {  // Target日付に対する本日、祝日、空文字列のhintを返す
        let Today = new Date().toDateString();
        let year = Target.getFullYear(), y = year-2000,
            hday = ","+ (Target.getMonth()+1) + ","+ Target.getDate() +",";
        let hnm = findMrch(hday,y);
        // If the cell is the current date or holiday, highlight it
        if (Target.toDateString()==Today) hnm = '本日:'+ hnm;
        if (hnm!="") hnm = hnm.slice(0, hnm.indexOf(','));
	return hnm; 
}
function findMrch(hday,cY) { // 3月１日の曜日が同じ既知の近年で探す
    for (let y = (holY[cY])?cY:30 ;y>10;y--)
        if (new Date(cY+2000,2,1).getDay()==new Date(2000+y,2,1).getDay())
            if (holY[y].indexOf(hday)>=0) 
                return holY[y].slice(holY[y].indexOf(hday)+hday.length+2);
            else return "";
    return "";
}
var holY=new Array(),reader;
window.onload=function() {
  const tbl=document.getElementById("calendar");
  if (tbl&&window.File) {
   tbl.addEventListener("dragover", function(evt) {
      evt.stopPropagation();
      evt.preventDefault();
      evt.dataTransfer.dropEffect = "copy";
   });
   tbl.addEventListener("drop", function(evt) {
         evt.stopPropagation();
         evt.preventDefault();
         reader = new FileReader();
         reader.onload = function(e) {
             e.target.result.split("\n").forEach(function(value, index, array) {
                 let yy = value.slice(0,4);
                 if (yy.match(/\d{4}/)) {
                     if (value.slice(4,9)==",1,1,") // 年の始まり
                          holY[yy-2000] = value.slice(4)+",";
                     else holY[yy-2000] += value.slice(4)+",";
                 }
             });
         };
         reader.readAsText(evt.dataTransfer.files[0], "utf-8");
   });
  } else {
    window.alert("本ブラウザではFile APIが使えません");
  }
}
hols="年,月,日,曜日,祝日,";
holY[01]=",1,1,月,元日,1,8,月,成人の日,2,11,日,建国記念の日,2,12,月,振替休日,"+
"3,20,火,春分の日,4,29,日,みどりの日,4,30,月,振替休日,"+
"5,3,木,憲法記念日,5,4,金,国民の休日,5,5,土,こどもの日,7,20,金,海の日,"+
"9,15,土,敬老の日,9,23,日,秋分の日,9,24,月,振替休日,10,8,月,体育の日,"+
"11,3,土,文化の日,11,23,金,勤労感謝の日,12,23,日,天皇誕生日,12,24,月,振替休日,";
holY[02]=",1,1,火,元日,1,14,月,成人の日,2,11,月,建国記念の日,3,21,木,春分の日,"+
"4,29,月,みどりの日,5,3,金,憲法記念日,5,4,土,国民の休日,5,5,日,こどもの日,5,6,月,振替休日,"+
"7,20,土,海の日,9,15,日,敬老の日,9,16,月,振替休日,9,23,月,秋分の日,10,14,月,体育の日,"+
"11,3,日,文化の日,11,4,月,振替休日,11,23,土,勤労感謝の日,12,23,月,天皇誕生日,";
holY[03]=",1,1,水,元日,1,13,月,成人の日,2,11,火,建国記念の日,3,21,金,春分の日,"+
"4,29,火,みどりの日,5,3,土,憲法記念日,5,4,日,国民の休日,5,5,月,こどもの日,"+
"7,21,月,海の日,9,15,月,敬老の日,9,23,火,秋分の日,10,13,月,体育の日,"+
"11,3,月,文化の日,11,23,日,勤労感謝の日,11,24,月,振替休日,12,23,火,天皇誕生日,";
holY[04]=",1,1,木,元日,1,12,月,成人の日,2,11,水,建国記念の日,3,20,土,春分の日,"+
"4,29,木,みどりの日,5,3,月,憲法記念日,5,4,火,国民の休日,5,5,水,こどもの日,"+
"7,19,月,海の日,9,20,月,敬老の日,9,23,木,秋分の日,10,11,月,体育の日,"+
"11,3,水,文化の日,11,23,火,勤労感謝の日,12,23,木,天皇誕生日,";
holY[05]=",1,1,土,元日,1,10,月,成人の日,2,11,金,建国記念の日,"+
"3,20,日,春分の日,3,21,月,振替休日,4,29,金,みどりの日,"+
"5,3,火,憲法記念日,5,4,水,国民の休日,5,5,木,こどもの日,7,18,月,海の日,"+
"9,19,月,敬老の日,9,23,金,秋分の日,10,10,月,体育の日,"+
"11,3,木,文化の日,11,23,水,勤労感謝の日,12,23,金,天皇誕生日,";
holY[06]=",1,1,日,元日,1,2,月,振替休日,1,9,月,成人の日,2,11,土,建国記念の日,"+
"3,21,火,春分の日,4,29,土,みどりの日,5,3,水,憲法記念日,5,4,木,国民の休日,"+
"5,5,金,こどもの日,7,17,月,海の日,9,18,月,敬老の日,9,23,土,秋分の日,"+
"10,9,月,体育の日,11,3,金,文化の日,11,23,木,勤労感謝の日,12,23,土,天皇誕生日,";
holY[07]=",1,1,月,元日,1,8,月,成人の日,2,11,日,建国記念の日,2,12,月,振替休日,"+
"3,21,水,春分の日,4,29,日,昭和の日,4,30,月,振替休日,"+
"5,3,木,憲法記念日,5,4,金,みどりの日,5,5,土,こどもの日,7,16,月,海の日,"+
"9,17,月,敬老の日,9,23,日,秋分の日,9,24,月,振替休日,10,8,月,体育の日,"+
"11,3,土,文化の日,11,23,金,勤労感謝の日,12,23,日,天皇誕生日,12,24,月,振替休日,";
holY[08]=",1,1,火,元日,1,14,月,成人の日,2,11,月,建国記念の日,3,20,木,春分の日,"+
"4,29,火,昭和の日,5,3,土,憲法記念日,5,4,日,みどりの日,5,5,月,こどもの日,"+
"5,6,火,振替休日,7,21,月,海の日,9,15,月,敬老の日,9,23,火,秋分の日,10,13,月,体育の日,"+
"11,3,月,文化の日,11,23,日,勤労感謝の日,11,24,月,振替休日,12,23,火,天皇誕生日,";
holY[09]=",1,1,木,元日,1,12,月,成人の日,2,11,水,建国記念の日,3,20,金,春分の日,"+
"4,29,水,昭和の日,5,3,日,憲法記念日,5,4,月,みどりの日,5,5,火,こどもの日,5,6,水,振替休日,"+
"7,20,月,海の日,9,21,月,敬老の日,9,22,火,国民の休日,9,23,水,秋分の日,"+
"10,12,月,体育の日,11,3,火,文化の日,11,23,月,勤労感謝の日,12,23,水,天皇誕生日,";
holY[10]=",1,1,金,元日,1,11,月,成人の日,2,11,木,建国記念の日,3,21,日,春分の日,3,22,月,振替休日,"+
"4,29,木,昭和の日,5,3,月,憲法記念日,5,4,火,みどりの日,5,5,水,こどもの日,"+
"7,19,月,海の日,9,20,月,敬老の日,9,23,木,秋分の日,"+
"10,11,月,体育の日,11,3,水,文化の日,11,23,火,勤労感謝の日,12,23,木,天皇誕生日,";
holY[11]=",1,1,土,元日,1,10,月,成人の日2,11,金,建国記念の日,3,21,月,春分の日,"+
"4,29,金,昭和の日,5,3,火,憲法記念日,5,4,水,みどりの日,5,5,木,こどもの日,"+
"7,18,月,海の日,9,19,月,敬老の日,9,23,金,秋分の日,10,10,月,体育の日,"+
"11,3,木,文化の日,11,23,水,勤労感謝の日,12,23,金,天皇誕生日,";
holY[12]=",1,1,日,元日,1,2,月,振替休日,1,9,月,成人の日,2,11,土,建国記念の日,3,20,火,春分の日,"+
"4,29,日,昭和の日,4,30,月,振替休日,5,3,木,憲法記念日,5,4,金,みどりの日,5,5,土,こどもの日,"+
"7,16,月,海の日,9,17,月,敬老の日,9,22,土,秋分の日2,10,8,月,体育の日,"+
"11,3,土,文化の日,11,23,金,勤労感謝の日,12,23,日,天皇誕生日,12,24,月,振替休日,";
holY[13]=",1,1,火,元日,1,14,月,成人の日,2,11,月,建国記念の日,3,20,水,春分の日,"+
"4,29,月,昭和の日,5,3,金,憲法記念日,5,4,土,みどりの日,5,5,日,こどもの日3,5,6,月,振替休日,"+
"7,15,月,海の日,9,16,月,敬老の日,9,23,月,秋分の日,10,14,月,体育の日,"+
"11,3,日,文化の日,11,4,月,振替休日,11,23,土,勤労感謝の日,12,23,月,天皇誕生日,";
holY[14]=",1,1,水,元日,1,13,月,成人の日,2,11,火,建国記念の日,3,21,金,春分の日,"+
"4,29,火,昭和の日,5,3,土,憲法記念日,5,4,日,みどりの日,5,5,月,こどもの日,5,6,火,振替休日,"+
"7,21,月,海の日,9,15,月,敬老の日,9,23,火,秋分の日,10,13,月,体育の日,"+
"11,3,月,文化の日,11,23,日,勤労感謝の日,11,24,月,振替休日,12,23,火,天皇誕生日,";
holY[15]=",1,1,木,元日,1,12,月,成人の日,2,11,水,建国記念の日,3,21,土,春分の日,"+
"4,29,水,昭和の日,5,3,日,憲法記念日,5,4,月,みどりの日,5,5,火,こどもの日,5,6,水,振替休日,"+
"7,20,月,海の日,9,21,月,敬老の日,9,22,火,国民の休日,9,23,水,秋分の日,"+
"10,12,月,体育の日,11,3,火,文化の日,11,23,月,勤労感謝の日,12,23,水,天皇誕生日,";
holY[16]=",1,1,金,元日,1,11,月,成人の日,2,11,木,建国記念の日,3,20,日,春分の日,"+
"3,21,月,振替休日,4,29,金,昭和の日,5,3,火,憲法記念日,5,4,水,みどりの日,5,5,木,こどもの日,"+
"7,18,月,海の日,8,11,木,山の日,9,19,月,敬老の日,9,22,木,秋分の日,"+
"10,10,月,体育の日,11,3,木,文化の日,11,23,水,勤労感謝の日,12,23,金,天皇誕生日,";
holY[17]=",1,1,日,元日,1,2,月,振替休日,1,9,月,成人の日,2,11,土,建国記念の日,"+
"3,20,月,春分の日,4,29,土,昭和の日,5,3,水,憲法記念日,5,4,木,みどりの日,"+
"5,5,金,こどもの日,7,17,月,海の日,8,11,金,山の日,9,18,月,敬老の日,9,23,土,秋分の日,"+
"10,9,月,体育の日,11,3,金,文化の日,11,23,木,勤労感謝の日,12,23,土,天皇誕生日,";
holY[18]=",1,1,月,元日,1,8,月,成人の日,2,11,日,建国記念の日,2,12,月,振替休日,"+
"3,21,水,春分の日,4,29,日,昭和の日,4,30,月,振替休日,5,3,木,憲法記念日,"+
"5,4,金,みどりの日,5,5,土,こどもの日,7,16,月,海の日,8,11,土,山の日,"+
"9,17,月,敬老の日,9,23,日,秋分の日,9,24,月,振替休日,10,8,月,体育の日,"+
"11,3,土,文化の日,11,23,金,勤労感謝の日,12,23,日,天皇誕生日,12,24,月,振替休日,";
holY[19]=",1,1,火,元日,1,14,月,成人の日,2,11,月,建国記念の日,3,21,木,春分の日,"+
"4,29,月,昭和の日,4,30,火,国民の休日,5,1,水,即位の日,5,2,木,国民の休日,"+
"5,3,金,憲法記念日,5,4,土,みどりの日,5,5,日,こどもの日,5,6,月,振替休日,"+
"7,15,月,海の日,8,11,日,山の日,8,12,月,振替休日,9,16,月,敬老の日,9,23,月,秋分の日,"+
"10,14,月,体育の日,10,22,火,即位礼正殿の儀,11,3,日,文化の日,11,4,月,振替休日,11,23,土,勤労感謝の日,";
holY[20]=",1,1,水,元日,1,13,月,成人の日,2,11,火,建国記念の日,2,23,日,天皇誕生日,2,24,月,振替休日,"+
"3,20,金,春分の日,4,29,水,昭和の日,5,3,日,憲法記念日,5,4,月,みどりの日,5,5,火,こどもの日,"+
"5,6,水,振替休日,7,23,木,海の日,7,24,金,スポーツの日,8,10,月,山の日,"+
"9,21,月,敬老の日,9,22,火,秋分の日,11,3,火,文化の日,11,23,月,勤労感謝の日,";
holY[21]=",1,1,金,元日,1,11,月,成人の日,2,11,木,建国記念の日,2,23,火,天皇誕生日,"+
"3,20,土,春分の日,4,29,木,昭和の日,5,3,月,憲法記念日,5,4,火,みどりの日,5,5,水,こどもの日,"+
"7,19,月,海の日,8,11,水,山の日,9,20,月,敬老の日,"+
"9,23,木,秋分の日,10,11,月,スポーツの日,11,3,水,文化の日,11,23,火,勤労感謝の日,";
holY[22]=",1,1,土,元日,1,10,月,成人の日,2,11,金,建国記念の日,2,23,水,天皇誕生日,"+
"3,21,月,春分の日,4,29,金,昭和の日,5,3,火,憲法記念日,5,4,水,みどりの日,"+
"5,5,木,こどもの日,7,18,月,海の日,8,11,木,山の日,9,19,月,敬老の日,"+
"9,23,金,秋分の日,10,10,月,スポーツの日,11,3,木,文化の日,11,23,水,勤労感謝の日,";
holY[23]=",1,1,日,元日,1,2,月,振替休日,1,9,月,成人の日,2,11,土,建国記念の日,2,23,木,天皇誕生日,"+
"3,21,火,春分の日,4,29,土,昭和の日,5,3,水,憲法記念日,5,4,木,みどりの日,5,5,金,こどもの日,"+
"7,17,月,海の日,8,11,金,山の日,9,18,月,敬老の日,9,23,土,秋分の日,"+
"10,9,月,スポーツの日,11,3,金,文化の日,11,23,木,勤労感謝の日,";
holY[24]=",1,1,月,元日,1,8,月,成人の日,2,11,日,建国記念の日,2,12,月,振替休日,2,23,金,天皇誕生日,"+
"3,20,水,春分の日,4,29,月,昭和の日,5,3,金,憲法記念日,5,4,土,みどりの日,5,5,日,こどもの日,"+
"5,6,月,振替休日,7,15,月,海の日,8,11,日,山の日,8,12,月,振替休日,9,16,月,敬老の日,9,22,日,秋分の日,"+
"9,23,月,振替休日,10,14,月,スポーツの日,11,3,日,文化の日,11,4,月,振替休日,11,23,土,勤労感謝の日,";
holY[25]=",1,1,水,元日,1,13,月,成人の日,2,11,火,建国記念の日,2,23,日,天皇誕生日,2,24,日,振替休日,"+
"3,20,木,春分の日,4,29,火,昭和の日,5,3,土,憲法記念日,5,4,日,みどりの日,5,5,月,こどもの日,"+
"5,6,火,振替休日,7,21,月,海の日,8,11,月,山の日,9,15,月,敬老の日,9,23,火,秋分の日,"+
"10,13,月,スポーツの日,11,3,月,文化の日,11,23,日,勤労感謝の日,11,24,月,振替休日,";
holY[26]=",1,1,木,元日,1,12,月,成人の日,2,11,水,建国記念の日,2,23,月,天皇誕生日,3,20,金,春分の日,"+
"4,29,水,昭和の日,5,3,日,憲法記念日,5,4,月,みどりの日,5,5,火,こどもの日,5,6,水,振替休日,"+
"7,20,月,海の日,8,11,火,山の日,9,21,月,敬老の日,9,22,火,国民の休日,9,23,水,秋分の日,"+
"10,12,月,スポーツの日,11,3,火,文化の日,11,23,月,勤労感謝の日,";
holY[27]=",1,1,金,元日,1,11,月,成人の日,2,11,木,建国記念の日,2,23,火,天皇誕生日,3,21,日,春分の日,"+
"3,22,月,振替休日,4,29,木,昭和の日,5,3,月,憲法記念日,5,4,火,みどりの日,5,5,水,こどもの日,"+
"7,19,月,海の日,8,11,水,山の日,9,20,月,敬老の日,9,23,木,秋分の日,"+
"10,11,月,スポーツの日,11,3,水,文化の日,11,23,火,勤労感謝の日,";
holY[28]=",1,1,土,元日,1,10,月,成人の日,2,11,金,建国記念の日,2,23,水,天皇誕生日,"+
"3,20,月,春分の日,4,29,土,昭和の日,5,3,水,憲法記念日,5,4,木,みどりの日,5,5,金,こどもの日,"+
"7,17,月,海の日,8,11,金,山の日,9,18,月,敬老の日,9,22,金,秋分の日,"+
"10,9,月,スポーツの日,11,3,金,文化の日,11,23,木,勤労感謝の日,";
holY[29]=",1,1,月,元日,1,8,月,成人の日,2,11,日,建国記念の日,2,12,月,振替休日,2,23,金,天皇誕生日,"+
"3,20,火,春分の日,4,29,日,昭和の日,4,30,月,振替休日,5,3,木,憲法記念日,5,4,金,みどりの日,5,5,土,こどもの日,"+
"7,16,月,海の日,8,11,土,山の日,9,17,月,敬老の日,9,23,日,秋分の日,9,24,月,振替休日,"+
"10,8,月,スポーツの日,11,3,土,文化の日,11,23,金,勤労感謝の日,12,24,月,振替休日,";
holY[30]=",1,1,火,元日,1,14,月,成人の日,2,11,月,建国記念の日,2,23,土,天皇誕生日,3,20,水,春分の日,"+
"4,29,月,昭和の日,5,3,金,憲法記念日,5,4,土,みどりの日,5,5,日,こどもの日,5,6,月,振替休日,"+
"7,15,月,海の日,8,11,日,山の日,8,12,月,振替休日,9,16,月,敬老の日,9,23,月,秋分の日,"+
"10,14,月,スポーツの日,11,3,日,文化の日,11,4,月,振替休日,11,23,土,勤労感謝の日,";
